{
    "artists": [
        {
            "name": "Cleopatrick",
            "note": "Placeholder",
            "albums": [
                {
                    "name": "Bummer!",
                    "id": "7088a214-bef0-41b7-bf52-3c25feed7587",
                    "note": "Placeholder",
                    "songs": [
                        {
                            "name": "cleopatrick - THE DRAKE (Official Lyric Video)",
                            "id": "dc027fcf-317d-4e5c-af6d-9098b8f7f448",
                            "note": "Placeholder"
                        },
                        {
                            "name": "cleopatrick - GOOD GRIEF (Official Video)",
                            "id": "dfc2ffef-372e-4b4a-a51f-89077b6f53a3",
                            "note": "Placeholder"
                        },
                        {
                            "name": "cleopatrick - FAMILY VAN (Official Video)",
                            "id": "a3f373c7-1a54-4006-be02-8684ebe4e512",
                            "note": "Placeholder"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Duckwrth",
            "albums": [
                {
                    "name": "Nowhere",
                    "id": "f85033d0-0988-4fc4-9e52-861c9a77d947",
                    "note": "Duckwrths first album is a rich mid-2010s blend of cloudrap and rock music. He displays more creativity project on this project than nearly any project that's come from any artist after, including his own follow-up works. The tradeoff is that technically the project feels rough around the edges, to the point of being almost cringeworthy at points. That doesn't hold it back from being a bit of a hidden gem.",
                    "songs": [
                        {
                            "name": "PSYCHO - Duckwrth X The Kickdrums (Official Video)",
                            "id": "13129e4e-6ff1-4e7e-8011-e39809dd867f"
                        },
                        {
                            "name": "Duckwrth x The Kickdrums - \"INDICA la ROUX\" feat. Miloh Smith",
                            "id": "7cdb7ce0-4bf3-4179-b207-1b97266a7844"
                        },
                        {
                            "name": "Naruto",
                            "id": "ae6d983a-885a-4733-883b-708057ae9905"
                        }
                    ]
                },
                {
                    "name": "SuperGood",
                    "id": "0c03fac2-05b9-4d20-bac4-dcecb4cc9560",
                    "note": "This is a more recent Duckwrth project, where he sheds a lot of his earlier creativity in favor of a more commercially palpably sound. That doesn't mean that it's bad though, not by a long shot. Duckwrth still maintains a lot of creativity in this lane.",
                    "songs": [
                        {
                            "name": "DUCKWRTH - Kiss U Right Now (Official Visualizer)",
                            "id": "937524f7-89f8-4eba-83b0-de7ef12b7e21"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Greydon Square",
            "note": "'Science Rapper' Greydon Square had an issue with being too angry on his early works. It was hard to relate and vibe with a man very clearly pissed at the world. By this point in his discography, he had clearly turned that feeling into an optimism that his ideas might improve peoples lives.",
            "albums": [
                {
                    "name": "The Mandelbrot Set",
                    "id": "a8a0a1c1-46df-4a4c-81e3-1255924d0049",
                    "note": "This album came out when I was in highschool and, in my opinion, sounds better than when it was released. Greydon is able to cover up even his most half-baked ideas by spitting so Illy that dig what he's saying anyways.",
                    "songs": [
                        {
                            "name": "Peace Peace",
                            "id": "d155000c-2032-4eb8-bd08-172522fdfdde"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Injury Reserve",
            "note": "Injury Reserve was a rap group formed of producer Parker Corey, Nathaniel Ritchie, and Steppa J. Groggs.",
            "albums": [
                {
                    "name": "By The Time I Get To Phoenix",
                    "id": "1c0924e1-dbce-4fa5-9963-e8d079d41690",
                    "note": "They were beginning to find their footing in the music scene, when Groggs tragically died during the final stages of recording for this album. Due to the pandemic and general sentiment at the time, surviving members RiTchie and Parker Corey felt it appropriate to release the album still. I absolutely love this project.",
                    "songs": [
                        {
                            "name": "Injury Reserve - Superman That",
                            "id": "d1cad05f-20e1-4ff6-ad2b-9eb58a842c84",
                            "note": "The top comment on this song is 'Instant aux cord privledges revoked for life'. I hope you'll not judge it that harshly, maybe you'll even enjoy it."
                        }
                    ]
                }
            ]
        },
		{
            "name": "James Bay",
            "note": "James Bay is Harry Styles for people that don't want to admit they listen to Harry Styles. The man makes some incredible, innovative pop music.",
            "albums": [
                {
                    "name": "Electric Light",
                    "id": "0388de0d-e7c9-45b3-bbb6-7d98ca8d7fe1",
                    "songs": [
                        {
                            "name": "James Bay - Pink Lemonade",
                            "id": "54cf3d7a-0869-4f38-ba97-a80a9de6daf2",
                            "note": "This particular cut I heard on the radio going to/and from my office in San Bruno years ago. Bay has stuck with me as the type of guy that makes tracks worth staying current on. There's a real sense that he's your favoriate pop artists favoriate pop artist."
                        }
                    ]
                }
            ]
        },
        {
            "name": "Joey Purp",
            "note": "Joey Purp came onto the hip-hop scene in the mid 2010s with one of the most original, soulful, and creative sounds at the time. He was a part of the 'save money' group with Chance The Rapper and Vic Mensa. While his mustic has gone downhill after his initial releases, Joey has already dropped some timeless hip-hop.",
            "albums": [
                {
                    "name": "iiiDrops",
                    "id": "a510ec95-0c46-4024-9041-359829775967",
                    "songs": [
                        {
                            "name": "Morning Sex",
                            "id": "a4277068-eb75-4c4a-9edc-57179962985e",
                            "note": "This is the opening track on Joey's debut mixtape. A soulful, bombastic production with gospel samples and trumpets. God bless."
                        }
                    ]
                },
                {
                    "name": "QUARTERTHING",
                    "id": "d1a28d53-2aaf-424d-bb0f-de53a8a8a695",
                    "songs": [
                        {
                            "name": "2012",
                            "id": "f78d26fa-498e-429d-bffe-dca7a5902c6b",
                            "note": "This cut from Joey's first album is dreamy track that reminds of a quiet day at the park."
                        },
                        {
                            "name": "Godbody (Pt. 2)",
                            "id": "beb296a2-b5c3-40bc-8cb4-a865535ed0c8",
                            "note": "This is the second track from Joey Purps first album, technically a pt.2 to 'Godbody' from his mixtape. It features a brilliant spoken word intro from RZA and regal produciton."
                        },
                        {
                            "name": "Joey Purp - Aw Sh*t!",
                            "id": "23c65528-ee89-4815-af28-ef3d4407297e"
                        }
                    ]
                }
            ]
        },
		{
            "name": "Kendrick Lamar",
            "albums": [
                {
                    "name": "Section 80",
                    "id": "4ee0e10c-ea4e-4ac5-b06b-95d02aa42d29",
					"note": "I think this album is an underrated moment in Kendricks discography and hip-hop as a whole. Kendrick felt less of the temptations involved with making a full-on concept album here and it gives the project room to breath. There's also a few tracks here that are a lot more genuinely upbeat and lighthearted than some of Kendricks later work.",
                    "songs": [
                        {
                            "name": "Kendrick Lamar - A.D.H.D (Official Video)",
                            "id": "5fb18e9d-fb24-4d96-8410-032d3fc89568"
                        },
						{
                            "name": "Kendrick Lamar 'HiiiPOWER' OFFICIAL MUSIC VIDEO",
                            "id": "5339459c-d3b2-44c8-bf30-11feb9d2db87",
                            "note": "This track, the closer on the album, was apparently produced by J. Cole."
                        }
                    ]
                }
            ]
        },
		{
            "name": "Lupe Fiasco",
			"note": "Placeholder",
            "albums": [
                {
                    "name": "Samurai",
                    "id": "8366f4a2-4d91-47a6-b787-c9faa1aeeb4f",
					"note": "",
                    "songs": [
                        {
                            "name": "Lupe Fiasco - Cake (Official Music Video)",
                            "id": "ad905a9c-be59-47d4-a133-fe3085058853"
                        },
						{
                            "name": "Lupe Fiasco - Samurai (Official Music Video)",
                            "id": "bdfa2623-ac66-44ce-8e39-9251c936093d"
                        }
                    ]
                }
            ]
        },
		{
            "name": "Lucki",
			"note": "Lucki is through-and-through an underground legend turned TikTok star. Known for his signature 'tired' flow, lean gut, and suprisingly honest lyrics.",
            "albums": [
                {
                    "name": "WAKE UP LUCKI",
                    "id": "157e31bb-41b3-45bb-95ec-b78fd7f8c1b0",
					"note": "This album marked a point in Luckis career where he was becoming less underground, and needed to adopt a more commercially successful sound. Some fans hate this Lucki onwards, I still think he's pretty good",
                    "songs": [
                        {
                            "name": "LUCKI & F1LTHY - U.G.K (Official Video)",
                            "id": "43af602e-5431-4a56-8b60-43a7b0d6e710"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Mach Hommy",
            "note": "Haitain rapper Mach Hommy is a bit of an enigma. He's never revealed his face or name publically before, has never toured, and pulls his lyrics off of rap genius whenever they're posted. In short, he values his opacity. He's known for his quality beat selection, multi-lingualism and smooth bars on the haitain diaspora.",
            "albums": [
                {
                    "name": "Pray 4 Haiti",
                    "id": "ed0a8947-49c6-4347-9827-3d0081e064fe",
                    "songs": [
                        {
                            "name": "Kriminel",
                            "id": "d0987cea-7564-494e-8c0f-2cedb3cd6572",
                            "note": "The Chrous on this track roughly translates to: 'They say I'm a Criminal. Look I'm not a criminal. It's them that are criminals. It's those people that are criminals'. Mach Hommy is talking about the persecution he and his friends faced under former president Marthély in Haiti."
                        },
                        {
                            "name": "Makrel Jaxon",
                            "id": "5fc59237-5f5a-4ad0-b59a-99e42c107587"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Massive Attack",
            "note": "",
            "albums": [
                {
                    "name": "Blue Lines",
                    "id": "3a25785e-50ec-383c-89cf-fd512181449c",
                    "songs": [
                        {
                            "name": "Safe From Harm (2012 Mix/Master)",
                            "id": "823de184-19a6-4420-80b4-265afa81999c",
                            "note": "The opening track on massive attacks first, and most classic, album. Just a smooth trip-hop sound mixed with british vocals of questionable quality."
                        },
                        {
                            "name": "Five Man Army (2012 Mix/Master)",
                            "id": "b30b9943-9100-4d84-9ad2-69859ea88fbb",
                            "note": "My personal favoriate track on massive attacks debut album. Great rapping over a trip-hop beat with very nice singing on the backend. The drum line particularly addictive here."
                        }
                    ]
                }
            ]
        },
        {
            "name": "Mr. Bungle",
            "note": "Mr.Bungle is an experimental rock outfit that started out as a highschool band, they were signed to Warner Music when singer Mike Patton made that a condition to him accepting an offer to join the group 'Faith No More' as their frontmand. Mr.Bungle went on to produce some of the weirdest, most experimental rock of the 90s. They once joked they felt like they could release a blank CD as nobody from Warner was checking their work anyways.",
            "albums": [
                {
                    "name": "California",
                    "id": "54074f30-d926-3dc0-b1f1-5429e21d3d86",
                    "songs": [
                        {
                            "name": "Sweet Charity",
                            "id": "25b03e08-3a3a-488e-9a36-5a0a7e478459",
                            "note": "This is the opening track on the album, complete with Mike Pattons signature bombastic vocals. I have no idea what this song is about, but to me it evokes the feeling of the horror-movie trope of being in a remote, beachy town where something is sinister and not quite right."
                        },
                        {
                            "name": "Mr. Bungle- Pink Cigarette Music Video",
                            "id": "63a79672-d327-4d19-a86e-587523d07c32",
                            "note": "I love this song. This track is maybe the most accessible track Mr. Bungle has ever made, and demonstrates Patton's phenomental vocal range. The 'Pink Cigarette' is both a metaphor for a love that is intense but ultimately temporarily, and the literal cigarette left by Pattons star-crossed lover. Worth noting, the music video is unofficial."
                        }
                    ]
                }
            ]
        },
        {
            "name": "My Chemical Romance",
            "note": "",
            "albums": [
                {
                    "name": "The Black Parade",
                    "id": "d09de1f8-0ad8-37cc-ac71-342890279916",
                    "songs": [
                        {
                            "name": "My Chemical Romance - The Sharpest Lives",
                            "id": "bc25529c-ea16-46cb-8bb5-792b10ecf5a2",
                            "note": "A 'forgotten' cut from maybe the best emo album of all time. Makes me want to buy a walkman."
                        }
                    ]
                }
            ]
        },
		{
            "name": "Paris Texas",
            "note": "Is it okay to be a blatant industry plant if your music rocks? Paris Texas is a hip-hop duo out of LA testing this question. Along with acts like Teezo Touchdown and Kenny Mason, they're responsible for a sound-cloud inspired resurgence in the 'Rap-Rock' genere. Blending tradition rock instrumentals with hip-hop hi-hats and verse structures.",
            "albums": [
                {
                    "name": "Red Hand Akimbo",
                    "id": "d40e11f2-aabd-47eb-9490-6024c8f618e3",
                    "songs": [
                        {
                            "name": "Paris Texas - girls like drugs (Official Video)",
                            "id": "ce923052-bf43-45bb-99a6-167634eba2db",
                            "note": "This song blew up smally when it first came out, and blew up bigly (apparently) after Kanye plugged it a few months ago. Thanks Kanye for ruining my hipster cred."
                        }
                    ]
                }
            ]
        },
        {
            "name": "Pinback",
            "albums": [
                {
                    "name": "Pinback",
                    "id": "a4f059bd-881f-4805-bb5f-0ad098558253",
                    "songs": [
                        {
                            "name": "Crutch",
                            "id": "cafe60d4-2984-4179-aa92-8c03e339915b",
                            "note": "A lighthearted indie track with great instrumentation. 'Boo' is another great track from this band, that couldn't really fit into the playlist."
                        }
                    ]
                },
                {
                    "name": "Summer in Abaddon",
                    "id": "cefee04c-9dcc-427f-99a1-69549297c7f8",
                    "songs": [
                        {
                            "name": "Non Photo-Blue",
                            "id": "63a56b8a-a972-43a6-bb0e-2110e43fab26",
                            "note": "A lighthearted indie track with great instrumentation. 'Boo' is another great track from this band, that couldn't really fit into the playlist."
                        }
                    ]
                }
            ]
        },
		{
            "name": "J. D. (Puma) Lewis",
            "albums": [
                {
                    "name": "Boogie On The Mainline",
					"cover": "boogie-on-the-mainline.jpg",
					"note": "I found this album while sorting through vinyls at Paradise of Replica in Chinatown. I told the owner to help me find stuff that 'wouldn't piss anyone off' and to round out some of the more experimental music I wanted to add to this playlist, I think the owner did a great job.",
                    "id": "c436c383-a099-420f-a3a3-6333b58a08c6",
                    "songs": [
                        {
                            "name": "Dancing Shoes",
                            "id": "32e70bb8-7943-49a1-99e0-9850f7e76d31"
                        }
                    ]
                }
            ]
        },
		{
            "name": "Trust",
            "albums": [
                {
                    "name": "Boogie On The Mainline",
					"cover": "boogie-on-the-mainline.jpg",
					"note": "I found this album while sorting through vinyls at Paradise of Replica in Chinatown. I told the owner to help me find stuff that 'wouldn't piss anyone off' and to round out some of the more experimental music I wanted to add to this playlist, I think the owner did a great job.",
                    "id": "c436c383-a099-420f-a3a3-6333b58a08c6",
                    "songs": [
                        {
                            "name": "It's Not Over",
                            "id": "9f41d69e-b22f-41d2-a208-5599d4cf91aa"
                        }
                    ]
                }
            ]
        },
		{
            "name": "Imagination",
            "albums": [
                {
                    "name": "Boogie On The Mainline",
					"cover": "boogie-on-the-mainline.jpg",
					"note": "I found this album while sorting through vinyls at Paradise of Replica in Chinatown. I told the owner to help me find stuff that 'wouldn't piss anyone off' and to round out some of the more experimental music I wanted to add to this playlist, I think the owner did a great job.",
                    "id": "c436c383-a099-420f-a3a3-6333b58a08c6",
                    "songs": [
                        {
                            "name": "Strawberry Wine",
                            "id": "a6cc54d8-0199-4700-b99d-0d5466d76f53"
                        }
                    ]
                }
            ]
        },
		{
            "name": "Stroer",
            "albums": [
                {
                    "name": "Boogie On The Mainline",
					"cover": "boogie-on-the-mainline.jpg",
					"note": "I found this album while sorting through vinyls at Paradise of Replica in Chinatown. I told the owner to help me find stuff that 'wouldn't piss anyone off' and to round out some of the more experimental music I wanted to add to this playlist, I think the owner did a great job.",
                    "id": "c436c383-a099-420f-a3a3-6333b58a08c6",
                    "songs": [
                        {
                            "name": "Don't Stay For Breakfast",
                            "id": "ba30636f-c636-439f-ac4a-ec18ba7ab08f"
                        }
                    ]
                }
            ]
        },
		{
            "name": "Young Thug",
            "note": "#FreeThug",
            "albums": [
                {
                    "name": "JEFFERY",
                    "id": "23ffea4e-02a5-47d6-af66-be9077f0d483",
					"note": "This is the opener for what a lot of people consider to be Young Thugs best album, although that's often debated with Barter 6.",
                    "songs": [
                        {
                            "name": "Young Thug - Wyclef Jean [Official Video]",
                            "id": "0f4aa1df-56cb-49c4-a6e2-55386f144b12",
                            "note": "On top of the great beat and great vocals from Thug, I mostly just included this song for introducing the revolution concept of a diss-video. If you ever get a chance to check out the music video for this song outside of this party, I'd recommend it."
                        }
                    ]
                }
            ]
        },
        {
            "name": "Your Old Droog",
            "note": "Brooklyn rapper Your Old Droog sounded so much like NAS on his introduction to the scene that people thought he was a NAS alter-ego, Droog took this as a compliment.",
            "albums": [
                {
                    "name": "DBZ",
                    "id": "009b29f5-fc0b-4cae-906f-ed9ef1d20fc0",
                    "songs": [
                        {
                            "name": "Your Old Droog - DBZ ft. Denzel Curry, Method Man (Official Video)",
                            "id": "a48c99bd-0068-461b-aaa1-f246be43341a",
                            "note": "On this smooth, vintage sounding traffic over Madlib production. Denzel Curry, Droog, and the legendary Method Man collaborate over a smooth Madlib beat that proves anyone who says real hip-hop is dead isn't looking hard enough."
                        }
                    ]
                }
            ]
        },
        {
            "name": "Portishead",
            "note": "Portishead are trip-hop legends, and this album is consistently ranked in the top 100 albums of all time. Unfortunately, the majority of tracks are too gloomy or low-key to be playable at a party. ",
            "albums": [
                {
                    "name": "Dummy",
                    "id": "76df3287-6cda-33eb-8e9a-044b5e15ffdd",
                    "songs": [
                        {
                            "name": "Strangers",
                            "id": "e97f805a-ab48-4c52-855e-07049142113d",
							"note": "'Strangers' is fortunately an exception to this rule. Like a lot of trip-hop, the drums and drum samples really dominate here, and Beth Gibbons vocals are incredible."
                        }
                    ]
                }
            ]
        },
		 {
            "name": "The Bridge",
            "note": "This is another record-store vinyl find solicitied from Paradise of Replica in Chinatown. Smooth 1970s indie rock straight from the UK.",
            "albums": [
                {
                    "name": "Shame Is A Girl",
					"cover": "shame-is-a-girl.jpg",
                    "id": "ff6049fb-2845-470b-a07d-d5c16b304c74",
                    "songs": [
                        {
                            "name": "The Bridge - Shame is A Girl",
                            "id": "3dc6576e-5155-46a4-aede-05f51f1c9096"
                        },
                        {
                            "name": "The Bridge - Torn Between Two Lives",
                            "id": "af193c39-c344-4f26-b308-cdba95aa59e8"
                        }
                    ]
                }
            ]
        },
        {
            "name": "Zerfas",
            "note": "Zerfas was a psych-rock group out of indianapolis. Often described as what would happen if The Beattles leaned more into the psych sound on 'Revolver',",
            "albums": [
                {
                    "name": "Zerfas",
                    "id": "744b6d8e-bee6-45c3-a90d-409731fd7368",
                    "note": "This project was recorded and released in 1979 as the bands only album. It went on to become an underground classic, with copies of the original vinyl pressing selling for thousands of dollars. Zerfas continued to make music under the name 'Jubal' after its release.",
                    "songs": [
                        {
                            "name": "Zerfas - You Never Win",
                            "id": "06eb5739-81cc-4b83-a526-995851bcd78d",
                            "note": "This is the opening track on the album, dominated by a distorted and heavy riff. The sarcastic and dementing vocals, to me, represent your inner voice at a point when you're most harsh on yourself."
                        },
                        {
                            "name": "The Piper",
                            "id": "be8b30fe-cfdc-44ce-a3f4-486f9b599f07",
                            "note": "This is the final track on the album, a dreamy and psychedelic track referencing the story of the Pied Piper. If there was ever song Zerfas should have gotten famous for, it's this one. The version played here is a special release, and was not on the original album."
                        }
                    ]
                }
            ]
        }
    ]
}